analogdevicesinc/EVAL-ADICUP3029/projects/ADuCM3029_demo_cn0428_cn0429/src/adi_m355_gas_sensor.cpp
/**
******************************************************************************
*   @file     adi_m355_gas_sensor.cpp
*   @brief    Gas sensor class object source file
*   @version  V0.1
*   @author   ADI
*
*******************************************************************************
*
*Copyright 2015-2018(c) Analog Devices, Inc.
*
*All rights reserved.
*
*Redistribution and use in source and binary forms, with or without modification,
*are permitted provided that the following conditions are met:
*    - Redistributions of source code must retain the above copyright
*      notice, this list of conditions and the following disclaimer.
*    - Redistributions in binary form must reproduce the above copyright
*      notice, this list of conditions and the following disclaimer in
*      the documentation and/or other materials provided with the
*      distribution.
*    - Neither the name of Analog Devices, Inc. nor the names of its
*      contributors may be used to endorse or promote products derived
*      from this software without specific prior written permission.
*    - The use of this software may or may not infringe the patent rights
*      of one or more patent holders.  This license does not release you
*      from the requirement that you obtain separate licenses from these
*      patent holders to use this software.
*    - Use of the software either in source or binary form, must be run
*      on or directly connected to an Analog Devices Inc. component.
*
*THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
*INCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A
*PARTICULAR PURPOSE ARE DISCLAIMED.
*
*IN NO EVENT SHALL ANALOG DEVICES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
*EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, INTELLECTUAL PROPERTY
*RIGHTS, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
*BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
*STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
*THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*******************************************************************************
**/

#include "adi_m355_gas_sensor.h"
#include "adi_m355_gas_sensor_config.h"
#include "base_sensor/adi_sensor_errors.h"
#include "ADuCM3029_demo_cn0428_cn0429.h"

namespace adi_sensor_swpack
{

	/*
	 * Open M355 gas sensor
	 */
	SENSOR_RESULT M355_GAS::open()
	{
		pADI_GPIO0->DS |= (1 << 4) | (1 << 5);
		this->m_i2c_address = ADI_CFG_I2C_DEFAULT_ADDR;
		return(this->InitI2C());
	}

	/*
	 * Open M355 gas sensor with selected address
	 */
	SENSOR_RESULT M355_GAS::openWithAddr(uint8_t sensor_address)
	{
		pADI_GPIO0->DS |= (1 << 4) | (1 << 5);
		this->m_i2c_address = sensor_address;
		return(this->InitI2C());
	}
	/*
	 * Starts measurement
	 */
	SENSOR_RESULT   M355_GAS::start()
	{
		return(SENSOR_ERROR_NONE);
	}

	/*
	 * Stops measurement
	 */
	SENSOR_RESULT   M355_GAS::stop()
	{
		return(SENSOR_ERROR_NONE);
	}

	/*
	 * Close device
	 */
	SENSOR_RESULT   M355_GAS::close()
	{
		ADI_I2C_RESULT eI2cResult;

		if((eI2cResult = adi_i2c_Close(m_i2c_handle)) == ADI_I2C_SUCCESS)
			return SENSOR_ERROR_NONE;
		else
			return SET_SENSOR_ERROR(SENSOR_ERROR_I2C, eI2cResult);
	}

	/**
	 * @brief  Returns the temperature value
	 *
	 * @return SENSOR_RESULT
	 *
	 * @details
	 */
	SENSOR_RESULT M355_GAS::InitI2C()
	{
		ADI_I2C_RESULT eI2cResult = ADI_I2C_SUCCESS;

		eI2cResult = adi_i2c_Open(ADI_CFG_I2C_DEV_NUM, &m_I2C_memory, ADI_I2C_MEMORY_SIZE, &m_i2c_handle);
		if(eI2cResult == ADI_I2C_SUCCESS) {
			if((eI2cResult = adi_i2c_Reset(m_i2c_handle)) == ADI_I2C_SUCCESS) {
				if((eI2cResult = adi_i2c_SetBitRate(m_i2c_handle, ADI_CFG_I2C_BIT_RATE))  == ADI_I2C_SUCCESS) {
					return (SENSOR_ERROR_NONE);
				}
			}
		}

		return (SET_SENSOR_ERROR(SENSOR_ERROR_I2C, eI2cResult));
	}


	/**
	 * @brief  reads or writes data to/from the gas sensor
	 *
	 * @param  uint8_t RW, uint8_t RegAddr, uint8_t *pData, uint16_t size
	 *
	 * @return returns result of I2C communication
	 *
	 * @details
	 */
	SENSOR_RESULT M355_GAS::I2CReadWrite(uint8_t RW, uint8_t RegAddr, uint8_t *pData, uint16_t size)
	{
		ADI_I2C_TRANSACTION sTransfer;
		ADI_I2C_RESULT      eI2cResult = ADI_I2C_SUCCESS;
		uint32_t            nHwErrors;
		uint8_t             aPrologueData[5u];

		/* Set slave address for ADI M355 gas sensor */
		eI2cResult = adi_i2c_SetSlaveAddress(m_i2c_handle, this->m_i2c_address);

		if (eI2cResult == ADI_I2C_SUCCESS)
		{
			if (RW == READ)
			{
				aPrologueData[0]          = RegAddr;
				sTransfer.pPrologue       = &aPrologueData[0u];
				sTransfer.nPrologueSize   = 1u;
				sTransfer.pData           = pData;
				sTransfer.nDataSize       = size;
				sTransfer.bReadNotWrite   = true;
				sTransfer.bRepeatStart    = true;

				eI2cResult = adi_i2c_ReadWrite(m_i2c_handle, &sTransfer, &nHwErrors);
				if(eI2cResult == ADI_I2C_SUCCESS)
				{
					return(SENSOR_ERROR_NONE);
				}
			}

			else if(RW == WRITE)
			{
				aPrologueData[0]          = RegAddr;
				sTransfer.pPrologue       = &aPrologueData[0u];
				sTransfer.nPrologueSize   = 1u;
				sTransfer.pData           = pData;
				sTransfer.nDataSize       = size;
				sTransfer.bReadNotWrite   = false;
				sTransfer.bRepeatStart    = true;

				eI2cResult = adi_i2c_ReadWrite(m_i2c_handle, &sTransfer, &nHwErrors);
				if(eI2cResult == ADI_I2C_SUCCESS)
				{
					return(SENSOR_ERROR_NONE);
				}
			}
		}
		return (SET_SENSOR_ERROR(SENSOR_ERROR_I2C, eI2cResult));
	}

	/**
	 * @brief  initializes the sensor - requesting sensor status
	 * 			until 0x01 response received (IDLE)
	 *
	 * @param  uint8_t sensor_address
	 *
	 * @return returns result of I2C communication
	 *
	 * @details
	 */
	SENSOR_RESULT M355_GAS::SensorInit(uint8_t sensor_address)
	{
		uint8_t pBuff[2] = {0};
		uint16_t timeout = 5;
		SENSOR_RESULT Result = this->openWithAddr(sensor_address);

		do{
			Result = this->I2CReadWrite(READ, GET_STATUS, &pBuff[0], 1u);
			delay_ms(100);
			timeout--;
		} while((pBuff[0] != 0x01) && (timeout > 0));

		if (timeout == 0) return SENSOR_ERROR_I2C;

		return Result;
	}

	/**
	 * @brief Arbitrate address collisions using GPIOs to send a new address to slave if GPIO (SS) is low.
	 * 			All slaves can start with ADI_CFG_I2C_DEFAULT_ADDR, then call this function to set new address
	 * 			for given site.
	 *
	 * @param uint8_t new_I2C_address
	 *
	 * @return returns result of I2C communication
	 *
	 * @details
	 */
	SENSOR_RESULT M355_GAS::SetI2CAddr(uint8_t new_I2C_address)
	{
		uint8_t *pBuff;
		uint16_t timeout = 5;
		SENSOR_RESULT Result;
		pBuff = &new_I2C_address;

